{
  "last_updated": "September 24, 2025",
  "sections": [
    {
      "title": "Your Agreement with Us",
      "content": [
        "Welcome to GenRwin! By creating an account, you agree to follow these rules. These terms ensure a fair, safe, and fun environment for everyone in our community. If you do not agree, please do not use our services."
      ]
    },
    {
      "title": "1. Account Rules & Responsibilities",
      "content": [
        "To maintain a healthy community and ensure you get paid, you must follow these account guidelines:"
      ],
      "icon_list": [
        {
          "icon": "user_tick",
          "title": "Be Accurate:",
          "subtitle": "Provide true and complete information during signup. Fake details may block your payments."
        },
        {
          "icon": "key",
          "title": "Be Secure:",
          "subtitle": "Keep your password and account details confidential. You are responsible for all activity on your account."
        },
        {
          "icon": "profile_add",
          "title": "One Account Policy:",
          "subtitle": "You may only create ONE account. Creating multiple accounts will result in an immediate ban."
        }
      ]
    },
    {
      "title": "2. Earning Rewards & Payments",
      "content": [
        "Points and rewards are subject to the following terms:"
      ],
      "icon_list": [
        {
          "icon": "coin",
          "title": "Earning Points:",
          "subtitle": "Points are awarded only for successfully completed tasks as verified by our partners."
        },
        {
          "icon": "wallet",
          "title": "Withdrawals:",
          "subtitle": "Payouts are processed within 24-72 hours. We reserve the right to hold payments for security checks."
        }
      ]
    },
    {
      "title": "3. Prohibited Activities (Strict)",
      "content": [
        "GenRwin is a platform for real effort. The following actions are strictly prohibited and will lead to a **Permanent Ban**:"
      ],
      "bullet_list": [
        "Using VPNs, Proxies, or Emulators to fake your location or device.",
        "Using auto-clickers, scripts, or bots to complete tasks.",
        "Creating multiple accounts on the same device or network.",
        "Spamming our support team or using abusive language.",
        "Attempting to exploit bugs or glitches in the system."
      ]
    },
    {
      "title": "4. Limitation of Liability",
      "content": [
        "GenRwin is not responsible for any damages or losses related to your use of the app. We do not guarantee that the app will always be error-free or that specific tasks will always be available."
      ]
    },
    {
      "title": "5. Account Termination",
      "content": [
        "We reserve the right to suspend or terminate your account at any time, without notice, if we suspect you have violated these Terms. In such cases, all accumulated points will be forfeited."
      ]
    }
  ]
}